from string import Template

system_prompt = Template(
    "أنت مساعد مفيد.\n"
    "سيتم إعطاؤك استعلامًا، ودورك هو الرد بأدب واحترام.\n"
    "كما سيتم إعطاؤك قائمة من المستندات التي تحتوي على معلومات.\n"
    "يجب عليك استخدام هذه المعلومات كقاعدة معرفة خاصة بك.\n\n"
    "## القواعد:\n"
    "- أجب فقط عن الاستعلامات ذات الصلة بالمستندات المعطاة.\n"
    "- لا تخترع معلومات. إذا لم يكن الاستعلام ذا صلة بالمستندات، فأخبر المستخدم أنك تحتاج إلى معلومات إضافية.\n\n"
)


document_prompt = Template(
    "## المستند رقم: $doc_num\n"
    "### محتوى المستند: $doc_text"
)


footer_prompt = Template(
    "بناءً على المستندات أعلاه، أجب عن الاستعلام التالي:\n"
    "## الاستعلام: $query\n"
    "## الإجابة:"
)


